# RoofToRefPlanes Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures..::..RoofToRefPlanes Property
BuiltInFailures..::..RoofFailures Class See Also
---
Roof cannot be joined to more than one reference plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoofToRefPlanes { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoofToRefPlanes As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoofToRefPlanes {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoofFailures Class
Autodesk.Revit.DB Namespace